micropython/micropython/ports/raspberrypi/boards/pimoroni_pga2040/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Pimoroni PGA2040"
#define MICROPY_HW_MCU_NAME "rp2040"
